
{
    "133u8nd": {
        "As someone else had pointed out previously The article mentions a \"trove of documents\", and then references \"the documents\" 22 times, but never mentions exactly when these documents came into WSJ's hands.": {
            "Binders full of women?": [
                "Ahh, the good ol days.\n\nWe went from binders full of women (leaning away from sexism, poor execution), to grab em by the pussy (which had no effect on the religious right, no surprise)",
                "Well, not quite women."
            ],
            "Ah... that would be the 2pm penciled in on the week we aren't showing\n\nI joke, but also i do believe epstein was capable of talking to people about other things. Doesn't exonerate him by any stretch of the imagination but just because he had a meeting with someone doesnt automatically make them a piece of shit.": [
                "I agree, the dude was a wealthy financier involved in all sorts of businesses, it would be a hell of a stretch to assume that because he ever met with someone it was for the express purpose of diddling kids. Hitler had to have a haircut guy, right? Doesn't mean that the barber was involved with the Holocaust.\n\nThat said, the chief of the CIA is a very interesting contact to have in your address book. There's a lot of speculation on Epstein's potential as an intelligence asset; people in his line of business have always held a position of interest in that world (Clay Shaw, anyone?) So while I wouldn't rush to condemn anyone on this list, it's an interesting if macabre thought experiment to consider the leverage he held over famous and influential people, and the value of that information to the CIA."
            ],
            "That's the WSJ for ya ;]": [],
            "and im sure everyone will rest easy knowing nothing will ever happen to those involved, those guilty and those who are truly accountable. they are sleeping on pillows of gold thread stuffed with blood covered cash": []
        },
        "Epstein was supposedly a \"finance genius\" and ran a succesful hedge fund... but there is no evidence of him being a genius or of the hedge fund even existing. It looks like his __only__ epxertise was being a human trafficer and a pedophile.\n\n-\n\nP.s.: Alex Acosta gave Epstein an increadibly light prison sentence for running a child sex trafficking ring. More importantly, he gave __immunity__ to his co-conspirators. Basically, everyone got a great deal in exchange for __NOT__ giving any information, the exact opposite of how these deals are supposed to be handed out by the prosecutors. When asked about that, he said *\"I was told he [Epstein] belonged to intelligence\".* Everyone should keep that in mind.": {
            "Blackmail from a honeypot seemed to work well for him. Until it didn't.": [
                "Do you really think he would be able to blackmail more than a few important people until the word got around and/or he was killed? He was friends with all of those people for decades and his circle of friends just kept expanding. In other words, he was providing a service to the rich and powerful, not blackmailing them.",
                "I`m convinced it was a cia/mossad joint honeypot collecting blackmail on the powerful. Maxwells father had ties to mossad and a suspicious death.",
                "When you’re doing secrets things with someone you’ve known for years you’re more like to tell them your other secrets, which he could then pass on. Additionally, blackmail doesn’t need to be overt. The implication of it can be control enough. There are literally books on how to turn people.",
                "It wasn't him doing the blackmailing. He was just the tainter.",
                "Her father was in the honey yacht biz for intel allegedly. Very interesting rabbit hole if you look up the yachts and who sold them. Almost all the honeyachts came from the Kashogis spelled wrong on purpose. If you know, you will see it. They even sold a yacht to a former US president.",
                "More like he was a CIA asset until he made too much noise",
                "I think he went too high up. Sort of like one of those \"fuck around\" instances. Except he died. I'm exaggerating if you can't tell.",
                "Who says it didn't? There's a very real possibility that Epstein is still alive, plastic surgery, living in some tropical paradise. Are we really to believe if he really was running a honeypot operation, he didn't have a kill switch if something happened to him and all the names, juicy details would be released?"
            ],
            "Sealed the plea bargain and kept it secret from the victims so they couldn’t object. His “jail” time allowed him to leave jail 6 days a week to his office": [
                "Didn't Trump try to hire the same guy who gave him that deal into his administration, but the backlash was too much even for Trump?",
                "It looks like the justice dept forgot to do justice. It looks like justice is left to us to do.",
                "Of course he was out of jail more than in during his punishment. How else could he meet with his wealthy friends and government officials. I’m",
                "Source? That's insane"
            ],
            "It's important to note that Acosta gave immunity to Epstein, and 4 known co-conspirators, but also any additional co-conspirators that may be discovered. He made sure that literally no one would be held responsible for an organization that trafficked children for sex. Alex Acosta has done more to promote and defend child rape than any prosecutor in the history of the justice system. He is objectively in favor of child rape.": [
                "But only if it's being committed by the owner class, of course."
            ],
            "You're right there wasn't a hedge fund. It was actually what's called a special purpose vehicle (SPV) in the finance world. The one Epstein managed was called Liquid Funding Ltd. and it was a subsidiary of the investment bank Bear Stearns. The ICIJ did some good work piecing this together for the public. \n\nNow holding that position doesn't mean he's an expert, because it's likely the SPV only existed to hold toxic (extremely high risk or devalued) assets for Bear Stearns. So it seems Epstein was mostly a financial bagman for illicit transactions.": [
                "[Here's a list of 37 companies](https://opencorporates.com/corporate_groupings/Jeffrey%20Epstein/companies) associated with Jeffrey Epstein. There are three \"liquid funding\" companies listed! My favorite has to be [GHISLAINE CORP](https://opencorporates.com/companies/us_fl/P95000027272)."
            ],
            "The victoria's secret documentary made an interesting point. All of the video evidence (and epstein had every room in every single property recorded at all times, so the archive was extensive) went missing. It had been noted in the initial investigation, but went missing during the investigation, along with a detective on the case. Apparently, he's thought to be in Russia, and there's talk of the Israelis having access to it. \n\nThe doc dropped that little tidbit in the last episode. They spent maybe 5 minutes on it, then kept going. Ummmm....whaaaat??? It would explain why so many political and media people seem to be pro-russia these days. Putin just sends them a still image of a certain night, and boom, he owns them.": [
                "In 2016 the Russians then DNC AND the RNC servers. They exposed the DNC secrets (and placed phony info in there too) to hurt the Democrats AND they kept all the republican secrets to themselves to help and blackmail the Republicans."
            ],
            "Soon as Trump was elected he brought Acostas onto White House Staff.  Pretty much the only thing Acostas did while on staff was campaign a bill to cut the department that over sees sex trafficking crimes by 80 percent. \n\nThe Epstein scandal would end up breaking while this bill was close to getting the support it needed to pass and he would shortly after the scandal broke end up resigning. Trump would end up speaking on his behalf twice in the following few days saying Acostas was a good man blah blah.\n\nWhat a lot of people don't know is Acostas was the same FLA AG who sealed Trump's own 2007-8 rape case at an Epstein property.  Months before Epstein's own case.  Trump was exposed by other lawyers in the Epstein case as an informant.  One lawyer going so far as to say Trump was the only person who freely gave up information in the case against Epstein.  NO SHIT cause he had his own rape allegation.": [
                "This is great info to share if true, but can you provide any source for the claims about Trump giving info on Epstein, Acosta sealing Trumps 07-08 case, etc. I don’t want to repeat misinformation.",
                "oh this is just a coincidence, it's not like Trump also had Epstein's defense attorney as a campaign surrogate, or a long and documented history of association with Epstein."
            ],
            "Epstein was a financial genius, just not in the ways he wanted the public to believe. He was a master level manipulator who was also a master at making social connections. It wasn't just his personal funds, but the access he had to people who cumulatively had billions of dollars and politicians at the highest levels of power. Epstein could use his influence to recommend his friends to donate to a certain cause, park their millions in a certain bank, invest in a company, or do political favors for him and his friends. The banks that worked with him knew the horrible things he was up to, but turned the blind eye because he could bring them untold amounts of deposits. He'd take finders fees for these types of transactions. He'd also just take gifts or property at an extreme discount. His planes, and a few of his properties, were gifts from Les Wexner. Wexner signed over power of attorney privileges to Epstein, where he had complete control over his finances. \n\nHe also would donate to anyone who could potentially hold him accountable. Police forces, politicians, etc. He got away with all of these horrible things because he was too useful to everyone around him. He provided social connections to the most powerful people in the world, he could get you millions of dollars with a drop of a hat, he could exchange information to intelligence agencies or governments to prevent them from looking into his crimes, and he could hold that honeypot blackmail over the heads of those who participated and crossed him. He tried to legitimize himself like most awful wealthy people do, by donating tons of money to universities, charities, and donating to scientists to fund their research. Classic reputation laundering. This access also got him in the same rooms as these people, making him seem legitimate and doing a good deed. \n\nOne of his biggest schemes that's relatively untalked about [is the Towers Financial Corporation](https://en.wikipedia.org/wiki/Towers_Financial_Corporation), which was the largest ponzi scheme in history before Bernie Madoff was busted. He also got away from this scheme without any accountability, and his co-conspirator Steven Hoffenberg said he was stealing large amounts of that money for himself. [Hoffenberg characterized Epstein](https://www.vanityfair.com/style/2021/12/how-the-only-known-photo-of-prince-andrew-and-the-pedophile-happened), \"You’re talking about a sociopath who was only interested in advancing himself monetarily, and every component of his existence was at the destruction of other people. His only interest was how to use other people, their wealth, and their access, in order to advance himself. He destroyed everybody in his path.\" \n\nI think the trafficking element was primarily to feed his own sick addiction, as well as one more service he could provide to his clientele to help get him access to their money/power. Especially for the rich, awkward, dorks he hung out with, Epstein looked like a cool socialite playboy in their eyes. He also would help facilitate finding women to marry off to these rich weirdos too. The ultimate reward for some long term victims, would to be married off to a wealthy dude. Since they were groomed by Epstein as well, they're more likely to accept the same behavior from the person they're married to. Many victims also helped recruit other victims, in exchange for more money. You can see where this goes.\n\nTLDR : Epstein was an illicit finance genius.": [],
            "He was an influence peddler, a lot of very rich people's success and future success depends on their ability to either personally connect to other very rich people or have connections available for their children to connect to very rich people. A lot of ways very rich people do this is through exclusive private schools, exclusive social clubs, frats/secret societies, philanthropic events, political fundraisers, favor exchanges, ect.\n\nEpstein facilitated a lot of these, this was a very valuable service, if you're a millionaire movie producer and your son wants to get into politics, Epstein was a guy you could go to to trade a future favor for a current one. Epstein could get your kid straight out of college and into a mid tier position for someone in someone inportants campaign. Maybe next a musician will want to be in a movie to move his career forward, Epstein can call in a favor with a producer to get them in a movie in exchange for a later favor. Maybe someone will come to him later who needs a boost in campaign funding, Epstein can bankroll a fundraiser where he can invite several high dollar donors who want to be involved in politics and maybe a big name musical act to cap it off. \n\nSort of influence pedaling was a bridge for the wealthy who needed extra influence beyond their own circle. His plane was a great way to offer these people favors that he could exchange for different favors down the line. He isn't the only one who does this, it's fairly common, he's just the most famous one today because of his legal problems.\n\nThese kind of influence peddlers have been around since the aristocracies of Europe started to fall, most tried to maintain their position through investments from their estates and many gambled their fortunes away. Others used their entrenched connections with business to sell their influence with both business and the crown to maintain their estates, they had to do it or get a real job. Early intelligence activities relied on becoming friends with these people. They had access to people from the top of their government to local ship builders and munitions suppliers, their cousin might be 5th in line to the Crown. So as time went on and capitalism created a new upper class and connection to the crown became less useful other just merely rich people or influential people became just as useful. In World War II Abwehr agents were given hard cash and told to essentially go to parties with these rich influence traders so they can make these connections that would give them intelligence. \n\nAs one of these influence peddlers Epstein is a natural target for intelligence agencies. It makes sense that an agency would want to know what favors people are asking from him.": [],
            "He had a hedge fund called Financial Trust Company, based on the US Virgin Islands. It was claimed they only accepted billionaires, but that's unlikely. It did, however, exist, and is included in the lawsuits against Chase.": [],
            "He was probably running the pedophile rings so the evidence could be used against the pedophiles to control them.": [
                "Such programs don't usually so much control people as they do use them when they need a \"favor\". If they're not compliant then they'll just ruin them or try to get them to ruin themselves. Controlling someone isn't as predictable or possible as movies potray."
            ],
            "The agreement was later deemed illegal by a judge. Acosta ended up immediately being named dean of Florida International School of Law and was then named Secretary of Labor under Trump.\n\nIt may have been illegal, and immoral, but it was a great career move.": [],
            "Also people talk about Ghislene Maxwell. However they don’t often mention her father Media Mogul  Robert Maxwell. \n\nHis history is worth it’s own story. Especially with his connections to M16, KGB and Mossad. Interesting to know what he passed down to his daughter. Also add in his shall we say mysterious death. \n\nhttps://www.theguardian.com/world/2000/oct/14/freedomofinformation.uk\n\nhttps://unherd.com/2021/02/robert-maxwell-was-no-mystery/\n\nhttps://www.timesofisrael.com/for-writer-who-broke-epstein-case-a-rumored-mossad-link-is-worth-digging-into/": [],
            "He was a fraud that thought surrounding himself with powerful people would make him accepted into their shitty circles.\n\nHalf of that was donations with other people’s money, the other half was maybe blackmail, but more likely he enjoyed raping young girls and found other rich perverts.": [],
            "That last line has always resonated with me. \n\nTo me it breaks down into one of two things being true (or maybe both) \n\nEither it was total bullshit and was used to cover up bad acts by intelligence leaders \n\nOr\n\nHe actually was used by the intelligence services to collect blackmail and other material. It's fairly known that the intelligence community routinely breaks US law either outright or through a pretzel-like legal analysis that interprets their acts to be constitutional.": [],
            "> \"I was told he [Epstein] belonged to intelligence\"\n\nMovie plot: The CIA runs Epstein to gain kompromat on leaders all over the world. A kabal of global billionaires run the CIA as an actual shadow government, pulling political strings to further their interests. The discovery and investigation of Epstein leads to a clandestine operation to kill him and cover it up.": [],
            "One of his trafficking victims testified that he procured legitimate American passports in order to traffic women overseas.": [],
            "Epstein was absolutely a pimp to the richest and most powerful, gaining cover for his clients and laundering his money as a hedge fund operator.": [],
            "That's Florida for ya": [],
            "Belonged to, more like provided for. If the CIA chief was getting his thanks to children Epstein trafficked then it makes sense this notion of him “belonging” to intelligence. \n\nNow that I write it, I wonder if it maybe meant like they owned him.": [],
            "Yeah, foreign enemy intelligence": [],
            "I still don't entirely understand how he became so rich.\n\nTrump, he isn't as rich as he claims, but I mostly get where his money came from. Zuckerberg, Musk, and Bezos are tools, but again, I understand where the money came from. This guy... I don't get it.": [],
            "I doubted your claim he wasn't a hedge/money manager, yeah he might have just been a fraudster.\n\nhttps://nymag.com/intelligencer/2019/07/hedge-funders-have-some-thoughts-on-what-epstein-was-doing.html": [],
            "Alex Acosta?  The guy who was in charge of investigating Trumps involvement in the alleged rape of a 13 year old?  The guy who Trump later appointed to be one of his cabinet secretaries?": [],
            ">More importantly, he gave immunity to his co-conspirators. Basically, everyone got a great deal in exchange for NOT giving any information, the exact opposite of how these deals are supposed to be handed out by the prosecutors.\n\nA reminder that this is exactly what happened with Hillary's FBI investigation and she got no punishment at all, so no one ended up with any punishment. And any of the other politicians similarly found to have flagrantly disregarded proper security with handling emails and the like have also not gotten punished. Any average joe gets prison time for this shit.\n\nWhich makes me think it must happen all the time with powerful people despite how we're told immunity deals are supposed to work.": [],
            "…and then Trump made Acosta his Secretary of Labour…": [],
            "It's that why trump gave Acosta a cabinet position?": [],
            "> When asked about that, he said \"I was told he [Epstein] belonged to intelligence\". Everyone should keep that in mind.\n\nThis is simply Acosta lying to cover Acosta's tracks.": [],
            "Keep in mind Trump was one of those people.": [],
            "Yep, and Trump gave Acosta a cabinet position.  He also used Epstein’s lawyer to defend him in both impeachments.": [],
            "Acosta, one could make a case, was Trumps least harmful cabinet selections to the working class.": [],
            "Leaves one to think that the duration of the sentence was moot because those powerful people knew he wasn’t going to live long enough to serve any length of sentence.": [],
            "This makes it sound like he had been working for the cia this whole time and they finally burn noticed him.": [],
            "All of these comments makes me wonder why Ghislaine Maxwell didn't reveal who the 'players' were in the pedo ring. Maybe she's afraid the same thing will happen to her that happened to Epstein? She could go into the Witness Protection Program.": [],
            "> \"I was told he [Epstein] belonged to intelligence\"\n\nSo was Epstein's mission one to get powerful people into compromising situations that the intelligence could be leveraged against them to keep them in line?": [],
            "A human trafficer and pedophile, who just happened to have alot of horny wealthy friends, all over the world, and plenty of pretty ladies willing to make a hard earned buck.": [],
            "Potential co-conspirators, if I recall. Meaning, the deal was that if there were a conspiracy, which officially there isn't, but if it turns out other people were in on it, they would have immunity for any actions they 'didn't' do.\n\nThere's never been a deal so sweet.": [],
            "The hedge fund definitely existed. There's financial documents tied to it. Some helpful excerpts in this article: https://nymag.com/intelligencer/2019/07/hedge-funders-have-some-thoughts-on-what-epstein-was-doing.html — it definitely seems like a nontraditional hedge fund and quite possibly a cover for other dealings but it did exist, had investors, and did make payouts.": [],
            "yeah he was a spook and someone too big got caught in his honeypot and it pissed off the wrong people so they burned him. It's like a plot from a movie but I actually think it makes more sense than billionaire hedge fund genius pedophile. He definitely was a creep, but he was a creep that some high level govt people had on a leash": [],
            "So CIA asset got it.": [],
            "There’s no blackmail possible here. Epstein was a hyper social billionaire, he didn’t have his crimes written on his forehead. The CIA head would spend much of his time where having sex with 16 years old is perfectly legal, like Australia and other places, and the notion Epstein was blackmailing or working with these people just because he was himself creepy is idiotic. Oprah road on the “Lolita Express” among many others that never get mentioned by the reddit mob squad.": [],
            "Maxwell is the one that \"belongs\" to intelligence. Her father . . . Mossad . . . Israel & the US . . . The \"elite\" clients . . . \n\nYou can connect the dots on your own.": [],
            "And didnt' Alex Acosta say the order to do so came from way above his head.": [],
            "That wasn’t his ONLY expertise.\n\nYou’re completely forgetting extortion.": []
        },
        "Name and shame them all. Don't give a damn about party lines, affiliations, political clout etc when it comes to trafficking children.\n\nProsecute everyone.": {
            "Of all listed, who had the resources to know all about Epstein? The CIA director. \nExcerpt: \n> Mr. Burns met with Epstein about a decade ago as he was preparing to leave government service, said CIA spokeswoman Tammy Kupperman Thorp. “The director did not know anything about him, other than that he was introduced as an expert in the financial services sector and offered general advice on transition to the private sector,” she said. “They had no relationship.”": [
                "Lol. “They had no relationship… well, except for the one I *just* mentioned of course!” Could she at least put some effort into lying for chrissakes?!"
            ],
            "Not gonna happen any time soon he was prolly running a honey pot for mossad and the CIA.": [
                "It’s dodgy as fuck I bet there’s plenty of innocent people who would speak out but know they have been in a meeting or flight with him at some point and can get public wrecked for a meeting they had once",
                "I mean *not* Mossad",
                "Abolish the CIA",
                "Probably won’t happen ever*",
                "Or russia.",
                "First time I'm hearing this allegation, and it makes a lot of sense."
            ],
            "If you name and shame everyone, you will end up targeting the wrong people. \n\nEpstein had leverage on EVERYONE. Not everyone would have had the same type, or degree of leverage. He might have leverage on someone for helping their kid get into an Ivy League school. On someone else for pedophilia. On someone else for helping swing a vote that they needed. \n\nThe reason we call it \"corruption\" is because it becomes so interconnected with the entire system, that you can't root out corruption without doing damage to the institutions that you are trying to protect. People like Epstein make sure that if you bring him down, both bad and good people go down with him.": [
                "Epstein purposely did everything he could to connect himself with important people, as part of his whole plan to make people seem guilty by association. \n\nEven people who literally never knew Epstein but took a picture with him once having no clue who he was. They would get their reputations destroyed having done nothing wrong. \n\nThat was Epstein’s whole plan. Basically to make himself too big to fail. Once all the important people realize that they had some kind of connection to him in some way, even if innocent, none would dare touch him because no one wanted to play defense even if they did nothing wrong.",
                "Not even leverage. Some people he was probably targeting but they didnt do anything.",
                "\"No, no, they were connected for the good kind of corruption.\" Fuck off with this nonsense. Do business with bad people, reap the rewards."
            ],
            "Prosecute people for being in someone’s calendar? I don’t know in what jurisdiction that would be considered a crime.": [
                "You wouldn’t prosecute them for being in his calendar… but you would sure as hell investigate as to why their names were there and find locations alibis for dates & times.",
                "You can never be too careful. We should probably prosecute everyone whose name *wasn't* on the calender just to be safe",
                "How the hell is that how you interpreted their comment?",
                "You think if a drug dealer had an appointment on his calendar with me to meet him a few times the police wouldn't use that to be all over my ass?\n\nIf it's enough for any of us to be investigated why isn't it enough for them to be?",
                "What if it was Osama Bin Laden's calendar? 🧐"
            ],
            "That might run 60% of politicians and leaders out of town. I’m all for it. Let’s take out the trash": [
                "Why do pedophiles end up in government? Like... I don't get it."
            ],
            "Name and shame is fun and all but I’m more of a indict and convict kinda dude": [],
            "I'll bet it's all the same people in the Panama Papers. We have lots of chances and evidence of who is doing wrong and lying about it and it's never going to happen.": [],
            "but how is the narrative going to be controlled if we can't divide people?": [],
            "I want heads on pikes. So fucking sick of nothing ever happening. \n\nThere comes a point where the edging stops being enjoyable.": [
                "Maybe you should consider a different outlet then. Outrage is probably not really doing it for you."
            ],
            "Kind of ruins the point of the whole honeypot operation unfortunately. Trafficking children isn't very high on the priority list": [],
            "Is there a \"Saved you a click\" comment naming them?": [],
            "…but that would mean the realization that the majority: elected, in the upper echelons of industry, and upper society individuals may be exposed, and targets. …screw it let it 🔥": [],
            "Is reddit dumb? Why are you getting upvotes and awards lol You know John Wayne gacy was friends with his whole neighborhood...right?": []
        },
        "I swear that I read a piece that said the CIA was using Epstein to honeypot targets": {
            "You did, it was kinda a well known open secret. Epstein was a horrible scum of a human being, but he was also a CIA asset. We were never going to know what he knew.": [
                "When Alex Acosta gave Epstein a sweetheart deal that bargained down multiple charges of child rape and child sex trafficking into one charge of soliciting a prostitute and further agreed to violate federal law by not telling the victims about the deal, he said that it was because an unnamed someone told him Epstein was an intelligence asset. He was open with this about the Trump transition team when he was made secretary of labor.",
                "US using horrible monsters to achieve their global political agendas? No way! /S",
                "“Epstein was a horrible scum of a human being but he was also a CIA asset”\n\nNo need to repeat yourself."
            ],
            "Dude that is wild…just imagining that a US government agency would knowingly allow the exploitation of children to maintain control.  I don’t mean to sounds naive, I know that people are capable of terrible things, but it’s just so over the top appalling.  How could anyone be okay with this??": [
                "Is it a surprise when that same agency has multiple times backed coups abroad???",
                "Dude, read a book. I doubt this even cracks the top 25, shit probably top 100, most heinous things the us government has ever done.",
                "Have done worse and not much change about it so... yeah",
                "It's reasonable to wonder how any typical person would be okay with this, they absolutely wouldn't. But the people with power over these things are not typical, many of them are sociopaths and/or extremely desensitized to horrific things, which is what allowed them to do the shitty manipulative things often required to get into high positions of power in the first place. Not literally everyone in power is like that, but at minimum they've probably benefited from someone allied with them being that way."
            ],
            "You were reading unfounded conspiracy theories.": []
        },
        "I just assumed I'd never qualify for any kind of security clearance because I've paid for sex, despite that I'd never do anything to breach any work-related rules nor break any security clearance rules. \n\nMeanwhile, we give Top Secret security clearance to 21 year old IT workers with internet addictions and this CIA bozo associating with Epstein? It's so stupid.": {
            "As long as you are honest, you would probably have a decent shot at getting a clearance.  \n\nYou can’t have a history of hard drug use.  Felonies are a no-go.   And, probably the biggest one, have decent credit and a history of paying your bills on time.   \n\nThe biggest motivator for most people that have divulged US secrets is money.   If you are irresponsible with money then you might be an easy target for a foreign govt.   \n\nI don’t think getting a hooker is that big of a deal as long as you admit to it.  I’m 95% sure that’s not even a question they ask.   If I was an investigator, I wouldn’t really care as long as you are single and honest about it.  If you were married, then that would make you a potential target for blackmail.": [
                "Yep, 99% of all questions the investigators ask are followed up with \"Could this be used against you?\"\n\nFor example, I was reprimanded (and technically fired) from my job at UPS when I was 22 years old for being a crappy worker.  When I was getting my clearance, I had to put those things on my forms.  Each time they asked \"could you getting reprimanded be used against you?\".",
                "Even felonies aren't always a hard no-go. Depends on what they were for, if you're honest and upfront about them, and your age/the situation plays a role. I had a TS/SCI clearance for a few years, the paperwork to fill out is a pain in the ass and the interview(s) can take a long time but they're mostly to verify the info and do a character assessment",
                ">You can’t have a history of hard drug use. Felonies are a no-go.\n\nMaybe the rules have changed since I had clearance, but this wasn't true back then. Having a history of hard drug use and/or a felony conviction will certainly make the process a little more involved, but I was always told that it's not a show-stopper as long as you're honest.\n\nThey know that people make mistakes and people have history; their main concern (apart from the fact that you should be clean *now*) is that you don't have any skeletons in your closet, because that makes you vulnerable to extortion. \n\n> And, probably the biggest one, have decent credit and a history of paying your bills on time. \n\nYes, absolutely. This is a big deal, because people who are irresponsible with money are prime targets for bribery.",
                "The problem with financial considerations is when the US economy goes into the toilet or inflation gets bad and average wages don't keep up (stagflation), more Americans get saddled with overwhelming debt and thus, less people qualify for security clearances due to financial concerns. I moved away from DC cuz I couldn't afford it anymore. But DC is also where most security clearance jobs are. Because that area's so expensive there's just gonna be less people living there who can qualify for a clearance. Thus, our fucked up economy is inherently a national security problem- we have a chronic shortage of qualified individuals who can work with classified information because so many people are struggling economically. Because of this shortage the US is overly reliant on people who get clearance through the military which is probably why we had that 19 year old idiot in the air guard spill secrets in a freaking discord server. Anyway It would behoove the federal government to encourage wage growth in our economy if they want to ensure less Americans have money problems and otherwise great applicants could qualify for NatSec jobs. Or alternatively the feds could stop centralizing all the national security jobs in such high COL regions.",
                "What about the opposite, getting paid as a sex worker? Would that be a DQ?",
                "Shit, you need a credit check just to get a customs broker's license in the US.  People in financial difficulty are definitely a top concern on security issues.",
                "Is trying any hard drug a no go?  Ive tried most hard drugs a few (~5) times each",
                "I had to lie and say I DID pot, they wouldn’t believe otherwise.",
                "Well, getting a hooker is a big deal but I don’t think I have to go into why that industry is bad and how using it reflects on you. I hope.",
                "This isn’t entirely true either. A good friend of mine got a TS and he had a looooooong history of doing hardcore drugs, was arrested, and had paid for sex. He was honest about it and had turned his life around a year or two before he applied for the job.",
                ">\tYou can’t have a history of hard drug use.\n\n*Recent* hard drug use is a problem. But they take into account how long. I have a relative who worked at the NSA (now retired) who talked about a colleague going through her TS/SCI interview. She was asked if she ever did any drugs. Back in the 1970s, she essentially said, she did *all* the drugs. She was asked how much, and an estimate would be fine. She laughed and said that one of the reasons for taking the drugs was too forget how much you'd taken.\n\nMy relative worked with her for over a decade."
            ],
            "The 21 year old was not able to purchase a gun because of past threats, , but was able to get security clearance... probably because the people in charge of giving it to him sound exactly like his Discord server in private.\n\nEdit/Follow Up: Got that weird ghost message reply pop up that I can't actually see here. Someone suggesting maybe the red flag laws that prevented him from getting guns were too strict. Possibly some weirdo I blocked and can't see? Anyway,  the other thing that came out was that he had very specific feelings and made multiple references to mass shootings and commiting random violence. So, I'd argue whoever or whatever decided he couldn't have a gun was much better at protecting Americans than whoever gave him security clearance.\n\nhttps://www.bbc.com/news/world-us-canada-65406559": [],
            "I've always assumed Epstein was working for the CIA and was a perv to boot.": [
                "Definitely. Nothing about Epstein's life story makes any sense unless he was some kind of asset. Beyond that it's all conjecture, which is maddening.",
                "Doing what exactly for the CIA?  Getting handies from underaged girls helps the CIA how?"
            ],
            ">> Meanwhile, we give Top Secret security clearance to 21 year old IT workers with internet addictions\n\nGood luck finding anyway to work in IT with that as a disqualifier": [],
            "I saw a kid get denied a clearance for a past rental eviction and $500 worth of medical debt.\n\nIt's a really messed up system.": [
                "That's at least what he/she told you, and financial debt is also the biggest red flag as the person becomes an easy target for blackmail and financial incentives from a foreign agent. Most security leaks in U.S. History are linked to financial gain or debt mitigation.\n\n  Anyone who is carrying $500 of past due debt, and not paying it off prior to trying to gain a security clearance is either a liar, or isn't trustworthy/reliable enough to be granted one."
            ],
            ">and this CIA bozo associating with Epstein?\n\nAnd he got a promotion because of it! First by Trump, then Biden.": [],
            "The ironic part is that if you’re willing to disclose that you’ve paid for sex, you’re more trustworthy  than 90% of the soulless cunts in Washington.\n\nAnd if we would just drop the stigma against sex work, paying for sex wouldn’t even be something that people could worry about being blackmailed for.": [],
            "Shit high af teenage TSA employees get security clearance": [
                "Uh no.  TSA employees with blue shirts at the airport don't work with classified documents.",
                "They don’t. First they do not have a need for one and second drug use is a disqualifier."
            ],
            "You just didn't pay the right people the right amount, apparently": [],
            "Well it depends on what the CIA bozo was doing.  If Epstein was running a CIA honeypot on *behalf of* the CIA, this may have been more like checking in with the Godfather than arranging for the head of the CIA to get a private rub and tug session.": [],
            "I can count on one hand the number of times I’ve heard a declassified “secret” and thought “holy shit”.\n\n\n\n\n\n\n\n\n\n[this being one of them](https://militarywatchmagazine.com/article/project-thor-what-america-s-new-rods-from-god-space-based-superweapon-can-do)": [],
            "I mean politicians basically have to have a DUI to be considered for office in the US": [],
            ">Meanwhile, we give Top Secret security clearance to 21 year old IT workers with internet addictions\n\nWhile that guy is rather young, I should point out that IT sees everything whether they want to or not. If you're hired for IT in any govt office you're usually granted the highest clearance level of any person you support, because it is possible you'll need to comb through their computer at some point.": [],
            "As long as you're honest about it they won't care about small stuff like that. It's when people hide things that they get denied": [],
            "First off the SF86 doesn't ask if you've paid for sex, although it may come up in a BI interview. However just cause you've paid for sex wouldn't disqualify you.": []
        },
        "Yup. The powerful elite aren't held accountable for shit.": {
            "Tale as old as time": [],
            "Of course, because the people who would hold them accountable are either profit from it or are sex pests themselves.": [],
            "Rules for thee but not for me": []
        },
        "Was JE an informant for the CIA?": {
            "More like Mossad.": [],
            "Crazy how those prison cameras stopped working huh?": []
        },
        "I'd like to comment but idk how I can since I CANT READ THE ARTICLE.": {
            "Clearly you don’t know how Reddit works": []
        },
        "I love how there's an actual pedophile/sex-slavery ring run by the elite but Republicans don't give a shit about that one. It's all about the pizza shop that has no evidence of such.": {
            "Trump is on there so tthy trying to avoid it": [],
            "They elect Gym Jordan. That says enough about Republicans. They approve of what Epstein was doing and are just glad people are talking about him and not them right now.": [
                "Don't forget [Dennis Hastert](https://en.wikipedia.org/wiki/Dennis_Hastert) the longest serving Republican speaker of the house is a convicted child molester"
            ],
            "I thought Epstein is the reason why pizzagate started": [],
            "They don't give a shit about any of it but they really don't want Clinton 2.0 so they'll throw anything at the wall.": [],
            ">  but Republicans don't give a shit about that one. It's all about the pizza shop that has no evidence of such.\n\nAnd don't forget gay and trans people.\n\nIt's almost like it's a distraction to cover up all of their crimes and the crimes of all the churches.": []
        },
        "We all know he didn't really kill himself.\n\nWe all know the powerful both did it and covered it up in broad daylight.\n\nAs Leonard Cohen said.. *Everybody knows*.": {
            "Everybody knows that the dice are loaded": [
                "Everybody rolls with their fingers crossed"
            ],
            ">Evwybody knows it. Evwybody knows it. Evwybody knows it's true.\n\n---Homestar Runner": [],
            "I don’t think they killed him. I think they just turned their back and let him kill himself, but I don’t know that.": [
                "[deleted]"
            ],
            "It’s possible, but there is no proof.  It’s also very possible that it is not much more than it seems.": [],
            "Heyy. The predictable conspiracy crap is only the 6th most upvoted comment this time. Maybe reddit is learning?": [],
            "Epstein killed himself.  He tried and failed, told his attorney during their final meeting he intended to attempt suicide again, and then died by suicide.": [
                "What’s the source on that? Genuine question not trying to call you out",
                "The guy had literally every reason to want to kill himself. But conspiracies are more fun than Occam's razor",
                "Agreed. A billionaire control freak pedophile committing suicide instead of going to hell on earth that is prison isn’t far fetched in the slightest.",
                "Autopsy report says otherwise."
            ],
            "He attempted suicide 2 weeks before he died haha. Zero evidence it was a conspiracy. Why wouldn't Epstein kill himself?? He was facing life in prison ffs!": [
                "How did he disable the cameras, make the guards fall asleep, and remove his cellmate? A lot of things outside of his control had to line up perfectly for the opportunity to exist. Somehow, in his cell, he knew that was the exact right moment that no guards were watching or doing rounds?"
            ]
        },
        "The fact that nothing has been done with this tells you everything you need to know about justice in the world.  There isn’t any.  The wealthy aren’t subject to the law.  Don’t ever let anyone tell you that we have law or justice in the US.  We have systematic oppression where the make “laws”, and then only apply them to those they want to persecute while others get a complete and total pass.  Justice would see those responsible severely punished for that alone.": {
            "And we collectively decided that this is an acceptable reality to inhabit. I wonder what that says about us.": [
                "That we're too afraid of the overwhelming force that the state will draw down on protesters and too dependent upon the corrupt hands that feed us."
            ],
            "It's just like locks, they are only there to keep out the honest folks.": [
                "What a stupid adage.\n\nLocks are there primarily to make you a slightly more annoying/difficult target to rob so that criminals won't bother picking you over more easy/vulnerable targets."
            ]
        },
        "Noam Chomsky was a bit of a shocker": {},
        "Supreme Court Justice on the list in 3...2...1...": {
            "More like 6..5..4..3..2..1": [
                "You win it today mah fren"
            ]
        },
        "William burns visiting him all but confirms that he was a protected top asset for multiple nations. Governments empowered and protected this guy so that he could traffick children for pedophile elites. This isn't a conspiracy theory anymore guys": {
            "Crazy how the Q-anon crowd thought was going to save the world from pedo elites when there was a real conspiracy and Trump was Epstein’s buddy for years.": [
                "It would not shock me to discover half the posts are made by CIA disinformation agents trying to change public opinion. Useful idiots fall for it and then spread it everywhere.",
                "The entire pizza-gate/q anon nonsense was likely created to distract from/both sides/discredit the real pedophile conspiracy."
            ],
            "\"Epstein didn't commit suicide\" might be the most widely accepted conspiracy theory. It just differs on who knocked him off.": [],
            "Do you think every government was cool with this? Probably not. It probably started as one bad actor like the KGB or Mossad and then other people we’re like “well don’t fuck up a good thing”, and potentially they couldn’t without violent repercussions.": []
        },
        "Noam Chomsky? Disappointing.": {
            "I've recently learned some things that make me approve less of him, like genocide denial and this. I've never been a fanboy,  but I've liked his messages overall.": []
        },
        ">The documents don’t reveal the purpose of most of the meetings. The Wall Street Journal couldn’t verify whether every scheduled meeting took place.\n\nHoly fuck has the WSJ gone downhill. \n\nLittle black address books…private calendars…this is not evidence. This is tabloid-esque speculation that should stay in rags like the NY Post. \n\nI swear these nothingburger stories are run to soften the blow when and if any actual evidence comes forward. Or they are just bait stories for low hanging outrage.": {
            ">Holy fuck has the WSJ gone downhill.\n\nThey've been running opinion pieces virtually every day defending Clarence Thomas.\n\nSo yeah, that's where they're at.": [
                "I always give opinion sections some grace because it’s at least segmented off and labeled as an idiot-zone. \n\nBut this is a top page exclusive editorial piece. Unreal coverage for a story that is mostly speculation."
            ],
            "WSJ and NY Post are owned by the same company.": [
                "Murdoch's rags",
                "And the parent company used to know how to keep the papers separately focused! \n\nNow there is no difference except WSJ has better market data.",
                "And owned by Robert Maxwell’s lifelong media rival",
                "So is Porsche and VW."
            ],
            "They're bait stories to stir up far right conspiracies and bait the QAnon types that the Republican party relies on to stay in existence. Hopefully this one won't directly lead to a farther murdering his kids or a brother murdering his brother or a kid killing his parents or any mass shootings like other shit spread by Murdoch, Flynn, and just the right wing media in general has.": [],
            "yup. I hadn't really paid attention to them until I saw a story about a topic I'm familiar with. the amount of stuff they completely fabricated was mind-blowing. like, I was in some of the meetings they were talking about and what they wrote was the exact opposite of what happened. \n\nI don't know if other \"news\" organizations are just as bad. the only time you really get to see how bad they are is the rare event where you were personally involved in something that makes it to the presses.": [],
            "Remember that episode of True Detective where Woody Harrelson and Matthew McConaughey found a book of names and addresses and that was it, we knew that everyone in the book was a ghoulish sex criminal because someone had their phone number? No?\n\nThat’s because you’d have to be a raving idiot to think that a criminal knowing someone makes them guilty of the same crimes as them.": [],
            "This should be pinned at top": []
        },
        "Anybody guilty of using Epstein's service that caters to pedophiles should be in prison, regardless of political party, affiliation, family, or social status.\n\nEdit: It's awful that this kind of statement is not universally accepted across the political spectrum. It's one thing that should be so obvious but somehow isn't. Like, why can't everyone just accept that pedophilia is bad? But instead these ghouls on r/RepublicanPedophiles insist that they are protecting children.": {
            "Probably because no evidence of such a service exists.": []
        },
        "> In addition to her current role as general counsel at Goldman Sachs, Ms. Ruemmler is co-chair of its reputational risk committee, which monitors business and client decisions for potential damage to the bank’s image. \n\n\nThis is laugh out loud funny": {
            "Inside knowledge I suppose makes for someone familiar with the risks.": []
        },
        "Blackmail is exceptionally lucrative.": {},
        "Years later and no investigations, prosecutions, resignations. Funny that.": {},
        "The rich and powerful like to rub elbows with the rich and powerful to try to become more rich and powerful.": {},
        "[removed]": {
            "We have more than our fair share of assholes. Why not send them to Texas": []
        },
        "yep.  we hear about Epstein's dealings for years now, but then it quickly goes away; it gets smothered.\n\nwake me up when there are people having actual charges brought upon them regarding Epstein and his sex trafficking children. i can't take getting my hopes up, then it goes nowhere.": {},
        "Bard College? Wasn’t that the college George Santos was an all American Gymnast or something at? It’s all coming together now": {},
        "Well yeah, the guy was a CIA asset who gave dirt (the rape of children) on prominent people to the government that it could use as a means of blackmail. It was kind of an open secret.": {},
        "Tbf, you can’t run a 100 percent banging teens operation all the time.. you have to blend in some legit people to lend an air of normalcy.": {
            "That seems to be the case, Stephen Hawking for example visited the island but dude was physically incapable of banging sex trafficked 14 year olds.": []
        },
        "Who was watching Epstein after his incarceration... let's see... I'm trying to remember... \n\nWasn't it Barr? Didn't he work for trump?\n\nI think that's it.": {
            "AG Bill Barr’s father hired Epstein for his first teaching job.": []
        },
        "Get me more evidence if I'm going to be shocked enough to grab pitchforks, investigate them and show me the evidence collected. After seeing the ridiculousness the Q idiots have dedicated themselves to based on vague notions, I'm gonna reserve any displays of anger or belief until I get more than notoriously connected criminal met with people - of course a guy trying to blackmail and entrap as many celebrities, powerful figured and ultra rich as he can is gonna get as many meetings as he can with those types of people. Show me evidence of who went through with abuses and let's prosecute them with that evidence.": {
            "Right? I guarantee only a small portion of his clientele were actual pedophiles. Past a certain point of elite social networking, he could position himself with any rich and powerful he wanted. From there, get some pictures with them and BAM, instant blackmail against them, even if they didn't do anything wrong, but if they even suspected he was up to no good. The threat of being \"connected\" to him would be enough to keep some people in line, either for financial loans or other favors, or even just to set up meet and greets with others in the hierarchy. Nothing illegal even has to have happened yet, but only for a certain reputation to precede itself and the work is 50% complete at that point.": [],
            "But the Qnons posted lots of pepe memes so therefore it must be true!": []
        },
        "Nobody puts Noamie in the corner": {},
        "Yes, we know. \n\nNothing will ever happen...": {},
        "Pray for this investigative journalist. My money’s on suicide by two gunshots to the back of the head.": {},
        "Non of them drag queens\n\nNot a single one if them arrested...\n\nAll of them Rich white power privilege": {},
        "So, another reason nothing will happen": {},
        "Wow. Is everyone as surprised as I am?!": {},
        "Missing Epstein calendar in 3.. 2… 1….": {},
        "Trying to compromise wealthy and powerful people was his **job**. I get that people should be investigated if they fell into his blackmail trap, but what about the investigation into who was funding him? If he was being funded by e.g. Mossad and there is evidence, then that should be made public.": {},
        "One of Epstein's roles as a CIA asset was to run honeypots and gather kompromat, so this isn't surprising": {},
        "All these people say things like: \"He served his time,\" and \"We believe in rehabilitation.\" I wonder how many of them employ minorities who have served their time and been rehabilitated.": {},
        "Dude was an intelligence asset if not a direct agent for the CIA. I wonder how much record there actually is of the activities on that plane and island.": {},
        "But Fox News told us that evil Democrats are keeping all his contacts secret and I need to always vote Republican no matter what and never think for myself again?": {},
        "Just a casual meeting w the cia chief. Yep, normal guy, and i’m seeing many a redditor trying to debate lord anyone who claims he didn’t kill himself. Which btw, he didn’t.": {},
        "Oh my God. People of reddit need a PSA: Just because you have associated with someone doesn't mean you are affiliated with their wrong doings. John Wayne gacy was friends with his whole neighborhood for example.": {},
        "Non paywalled version?": {
            "That's the whole article, it's not long enough to be obscured by the paywall": [],
            "Click on the share button underneath the title of the article, copy the link, and paste it into the url bar. Should do the trick.": []
        },
        "Our country is run by fucking criminals": {
            "Power corrupts and absolute power corrupts absolutely.": []
        },
        "Here’s how to say you are guilty without saying it. \n\n> When asked about his relationship with Epstein, Mr. Chomsky replied in an email: “First response is that it is none of your business. Or anyone’s. Second is that I knew him and we met occasionally.”": {},
        "CIA, eh? No wonder Epstein \"killed himself\".": {
            "He did kill himself.  Shortly after telling his lawyer he intended to attempt suicide for the second time.": [
                "He said he would never kill himself."
            ]
        },
        "Wasn't he an international information peddler on top of the sex trafficking?": {},
        "He was a billionaire. Those people have contacts": {},
        "Aaaaaaaaaaand nothing will happen.": {},
        "Can we just, like, collectively decide not to fuck kids? Is that too big of an ask? Really?": {
            "We did, that's why it's illegal.": [],
            "I thought we did, which is why these fucks fucking kids is such a big deal.": []
        },
        "Fuck feelings and politics, lock all those pedos and enables up!": {},
        "A CIA chief involved in your shenanigans.  That’s how you inexplicably die in your cell.": {
            "yeah... that would explain it": []
        },
        "CIA chief yeah this is getting covered up": {},
        "As a non-american that barely knows anything about epstein, did he not have any successful business or anything that could have given him connections to these people?": {},
        "So the chief? That explains alot.": {},
        "Don't forget two presidents.": {},
        "To the surprise of absolutely no one. 😒\nGarbage people.": {},
        "Wow, watch as nothing happens to any of these people. Why would they prosecute themselves lol.": {},
        "These people should have been named and arrested a long time ago. These monsters are being protected just because they have money which gives them access to immoral lawyers that couldn't care less what horrible things their clients did as long as they are being paid large sums of money.\n\nStuff likes this angers me so much because I was the victim of a violent rape and assault as minor and I've reluctantly accepted the fact I will never have justice for what they did to me. That pain and trauma leaves deep scars that never fully heal or go away. Because of what I went through I have zero faith in police and the justice system.": {},
        "Nothing will happen to them. They had him killed. Everyone knows.. but no one does anything about it. Why? Because they’ll make us disappear being the peons we are.": {},
        "What happened to the list his wife wrote?": {},
        "Is it too much to hope we could clear the vast majority of creeps out of Washington with this evidence?": {},
        "Epstein had a power brokerage where he connected powerful people and maybe even brokered information. \n\nWorking with him doesn't mean you had anything illegal going on. Heck, it sounds like his prostitution service employed far more people of legal age \n\nThinking everything he did involved statutory rape is extremely ignorant of the vast reach of his company. Heck, he was even known to use his business for a lot of very charitable causes as crazy as that sounds.": {},
        "Will anything be properly handled and investigated? No. Rules/ Laws only for you and me.": {},
        "Freaking good. Get 'em.\n\nFire sale time": {},
        "Imagine what kind of influence other billionaires have over people in power.": {},
        "Noam chomsky? That's certainly depressing if he did anything, guy is my hero.": {},
        "I'm not one to believe in conspiracy theories. But one I believed in from the start is this:\n\nEpstein was a honeypot for the CIA. Epstein has had \"two\" businesses.\n\nBusiness 1: Get people the CIA was targetting for intelligence in compromising positions and the CIA would use that as blackmail to get intelligence. In return for Epstein providing this service the CIA provided Epstein with cover so he could commit his dirty deeds.\n\nKeep in mind, this is the same CIA that flooded our streets with cocaine so they could find their private war (that's a fact)\n\nBusiness 2: Epistein would get rich people in compromising positions in return he would black mail them and they'd give him money.\n\nKeep in mind Epstein accomplice Maxwell I believe her name was had ties to Isreali Intelligence which likely gave him ties to the CIA.\n\nAlso keep in mind intelligence isn't always done on our enemies, hence Prince Andrew, Prince Andrew being British Royalty likely had at least some exposure to the British govt and likely provided the CIA with intelligence. \n\nAlso I don't believe business 1 and 2 where \"exclusive\" of each other and you could absolutely have crossover.\n\nFinally this is why I knew Epstein would be dead before his trial ever truly got underway.": {},
        "We are more interested in who he’s been keeping blackmail videos of on his encrypted flash drives seized by Bill Barr. I’m sure Barr is having a very comfortable retirement with that kind of dirt.": {},
        "Well ghislane maxwell's daddy was a hero of Israel so the mossad connect runs deep": {},
        "CIA chief and Goldman’s top lawyer? But I thought these were nice, honest guys!": {},
        "To access WSJ articles, click on the share button underneath the title of the article, copy the link, and paste it into the url bar.": {},
        "Epstein was a spy he traded in secrets": {},
        "Absolutely nothing will happen": {},
        "Take them all down, every last one of them, all the way down to hell": {},
        "He was blackmailing the fuck out of a lot of people. He had one hell of a video recording system in his homes.  Hidden cameras everywhere.  Don’t ask me how I know.": {
            "Because he knew what he was doing was inhuman and he got off on it": [],
            "Because its covered in like every story that talks about his home and everyone they interview who went to one of his homes talks about it?": [
                "Um. No.  But anyway…"
            ]
        },
        "Cue the “then why aren’t they arrested?!” comments when there’s no evidence of a crime. We don’t live in a country where you get hauled to prison because your name showed up in a bad guy’s address book. You can’t get arrested by association. There needs to be evidence of a crime.": {},
        "I'm willing to stake my next paycheck on that trumps name is in there.": {},
        "Wouldn't be surprised if the entire banking kabal was involved": {},
        "All billionaires and high ranking intelligence officials are pedofiles until proven otherwise.": {},
        "Bet musk was on there too": {},
        "Epistein’s *redacted* list you mean?": {},
        "It’s a big club and you aint in it.": {},
        "Yeah, but THOSE aren't the guys that had him killed. \n\nName some of the REAL names on that list.": {},
        "Epstein had the piss tapes": {},
        "610 comments?  That's it?  Peak reddit": {},
        "Here's my conspiracy theory: these people are expendable to satiate the public demand for a list of names.": {},
        "Are all wealthy people pedophiles? Wtf!?": {
            "Poor people can be pedophiles too. It's just that they get caught and go to jail...": [
                "Sure, but it’s looking strangely common among the wealthy elite."
            ]
        },
        "It's my personal conspiracy theory that Epstein is still alive and being hidden by wealthy benefactors.": {
            "Okay, but think about that for a second. What would be the benefit of that to the wealthy benefactor compared to just having Epstein be dead?\n\nBillionaires don’t keep potential trouble if they can just do away with it.\n\nThere are no advantages to your idea.": [
                "They're afraid of his clients list being leaked if he was dead.",
                "He definitely had offshore accounts no one knew about. Plastic surgery and living in a remote area he could get away with it. His kind of money and power he definitely could have disappeared.",
                "Dead man switch is threatened for a reason"
            ]
        },
        "Meeting with people is not a crime. Nobody has any proof any of those calendar contacts participated in any felonies, folks.": {
            "I have a hard time believing Noam Chomsky approves of underage sex trafficking.": []
        },
        "People as rich as he was get meeting with all sorts of rich and powerful people whenever they want. That doesn't mean every person who crossed his path was a pedophile.": {},
        "Is that Noam Chomsky in the bottom left corner? 🤔 \n\nI doubt he would associate with the likes of Epstein…": {
            "When asked about taking a private with Epstein to go to dinner, he told the WSJ it was “none of their business”": [
                "Wel, isn't that disheartening.",
                "Anyone with a faintly critical mind can understand why Chomsky wouldn't want to give any breadcrumbs to these tools of propaganda. And yet you are disseminating this propaganda for them. If you think for one second that Chomsky is a pedophile, I've got bad news for you"
            ],
            "He did": []
        },
        "Probably some Sullivan & Cromwell in there, too.": {},
        "Reporting back to his bosses on the Operation Honeypot": {},
        "Anyone else concerned about the advances of openAI and other companies over the past 45 days? With simple prompts AI can generate whole articles instantaneously with or without pictures, too!\n\nWhile the WSJ is a reputable publication, imagine where we’re going in the next 45 days.": {},
        "Enough evidence to convict him and Maxwell of sex trafficking, but not enough evidence to convict a single client? Hmmmm...": {},
        "And somehow only he and Maxwell have been prosecuted. Absolute bullshit!": {},
        "Prosecute them all and lock them all up if found guilty. Why the fuck is that not happening?": {},
        "You always hear so much dark shit about the CIA. What's going on there?": {},
        "Damn, too bad he offed himself in prison right when the guards weren't watching.  Ah well nothing to see here people.": {},
        "Prosecute all to the fullest extent of the law. Without exception.": {
            ">without exception.\n\nWith what evidence? Be careful, because just saying “they took flights to his island” doesn’t mean “they fucked kids,” or that they were even there to begin with. \n\nEven the article says as much - \n\n>\tThe documents don’t reveal the purpose of most of the meetings. The Wall Street Journal couldn’t verify whether every scheduled meeting took place.": []
        },
        "I’m going to go into business selling pitchforks!  Epstein was a huge POS.  But by the same logic was everyone in Bernie Madhoff’s calendar running Ponzi scheme?": {
            "Bernie Madoff was selling stocks with guaranteed returns. What was Epstein selling?": [
                "That’s not an answer to my question, is it?"
            ]
        },
        "[deleted]": {
            "Broke his own neck as soon as the cameras stopped working.  \n\nThat’s some James Bond shit": []
        },
        "Does this explain why the DOJ never does anything against Republicans sorta? I mean, if even your CIA is compromised, what then?": {},
        "Cia helping child abuse, why am I not surprised": {},
        "Where’s it been since his suicide?": {},
        "hey everyone.  get this.   he is the devil. as you know it.  anyone involved with him, well the same.  all of them. go to hell.": {},
        "And? What happens? That’s the part I still don’t get.": {
            "Nothing happens. Unless there's a victim coming forward to testify that something untoward happened, meeting with a piece of shit isn't a crime.": []
        },
        "r/Epsteinfakedhisdeath": {},
        "Now Matt gates is the new epstein": {
            "Not really, he’d be the new Trump. A politician using the services of that other guy they arrested for underage sex trafficking. And like Trump Gatez will face zero consequences.": []
        },
        "It’s a shame OP shot themselves in the back of the head 6 times": {},
        "why are people making excuses for this? gross. you’re just gross and probably ugly. i’m starting to believe that every account on all social media with STRONG unwavering political convictions on EITHER side are either mentally deficient, emotionally pathetic, sexually disturbed, and ultimately unloved individuals OR they’re all bots. i toggle between the two.": {},
        "Is there a bot that can read this for me?": {},
        "He is not dead and his wife (Ghislaine Maxwell) is not in prison.\nBoth are in occupied Palestine.\nBoth works for Zionist agencies.\nBoth are friends with Netanyahu.": {},
        "Anyone really surprised here. The only thing that would surprise me is that the would actually prosecute anyone.": {},
        "Dude was playing the CIA and the Mossad.": {},
        "IMO , if everyone knew everything about esptien Island, the population would upend everything because we know damn well the elite wouldn't surrender themselves. \n\nYou would see elites from both sides of the poetical spectrum and people who are at the head of every important organization who runs our society that all have a part I'm sure.": {},
        "Nightlife Musketeers: Who has influence that happens to be a FRB  board member that happens to be connected to Epstein, Trump, Manafort and acquitted as a unregistered foreign agent ..\n\n[https://en.wikipedia.org/wiki/Tom\\_Barrack](https://en.wikipedia.org/wiki/Tom_Barrack)": {},
        "Edit: Bypass the paywall:   https://archive.ph/gg5QZ#selection-315.0-330.0": {},
        "methinks some Blackrock and Vanguard board members don't want his little book seen... who knows not only how often THEY utilized his services, but their sons/duaghters as well.\n\nthese guys own everything and can do as they please, and they'll never let one of theirs go down, unless someone has to. probably what happened to epstien. bet there's some new connoisseur of depravity already filling their needs.": {},
        "LGBTQ+ is invading china! Somebody call Matt Walsh!!": {},
        "What happened to that prosecutor that wanted to go after chase bank for their connections to Epstein but got fired for it": {},
        "Interesting the takes in this thread vs the thread about Chomsky.": {},
        "Nothing has been done, and nothing *will* be done, to those that used Epstein's \"services.\" These little crumbs are just that. Evil has won and rules the world. Get used to it": {},
        "Isn't it a shame that Jeffey isn't avaliable to testify?": {},
        "I’m a little shocked to see Noam Chomsky here, but as I type this I’m wondering to myself “Am I really *that* shocked?”": {}
    }
}